<?php
/**
 * Created by PhpStorm.
 * User: p.semenyuk
 * Date: 01.07.2015
 * Time: 13:10
 */

namespace Sviaz;


class Executor
{

    public function execute()
    {

    }

}

/*

- выполнить правила предобработки и получить новую последовательность
- взять все мемберы из новой юпоследовательности
- проверить их в кандидаты в main  и положить их, если ок
- проверить их в кандидаты в depended и положить их, если ок
- их по каждой паре main->depended проверить свойства связи и положить удачные в согласование
-








 */